//--------------------------------------------------------------------------------------------------------------------------
//---Задача 19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.---
//--------------------------------------------------------------------------------------------------------------------------
/*
int Palindrome (int [] arr)
{
    int [] revers 
}
*/



int ConwertNumber (int num)
{
    string number = num.ToString(); //переводим число в строку

    int [] arr = new int [number.Length];
    for(int a = 0; a < number.Length; a++) arr[a] = Convert.ToInt32(number.Substring(a, 1)); //записываем число в массив
    
    //Console.WriteLine(string.Join(", ", arr)); //проверка записи цифр в массив

    int [] revers = new int [arr.Length]; 
    for(int i = 0, j = arr.Length-1; i < arr.Length; i++, j--) revers[j] = arr[i]; //записываем перевернутый массив
    
    //Console.WriteLine(string.Join(", ", revers)); //проверка записи цифр в перевернутый массив
    

    int result = 0;
    for(int i = 0, j = 0; i < arr.Length; i++, j++) //сравниваем массивы
    {
        if (revers[i] == arr[i]) result = 1;
        else
        {
            result = 0;
            break;
        }
    }

    //Console.WriteLine(result); // проверяем результат
    return result;  
}

Console.Write("Enter: ");
int number = Convert.ToInt32(Console.ReadLine());
int result = ConwertNumber(number);

if (result > 0) Console.Write ("+++ ");
else Console.Write ("---- ");

//---------------------------------------------------------------------------------------------------------------------------------------
//---Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.---
//---------------------------------------------------------------------------------------------------------------------------------------


//-----------------------------------------------------------------------------------------------------------------
//---Задача 23. Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N..---
//-----------------------------------------------------------------------------------------------------------------