
/*
string[,] table = new string[2, 5];
//String.Empty - инциализация пустой строки

//table[0, 0]   table[0, 1]     table[0, 2]     table[0, 3]     table[0, 4]
//table[1, 0]   table[1, 1]     table[1, 2]     table[1, 3]     table[1, 4]

table[1, 2] = "слово";

//распечатываем массив
for (int rows = 0; rows < 2; rows++) //строки
{
    for(int colums = 0; colums < 5; colums++)
    {
        Console.WriteLine ($"-{table[rows, colums]}-"); //индекс строки и индекс столбца
    }
}
*/



/*

void PrintArray(int[, ] matr) //метод печати двумерного массива
{
    for (int i = 0; i < matr.GetLength(0); i++) //строки; GetLenhth(0) - 0 - это колисество строк: 3 строки
    {
        for(int j = 0; j < matr.GetLength(1); j++)
        {
            Console.Write($"{matr[i, j]} "); //индекс строки и индекс столбца
        }
        Console.WriteLine();    
    }
}

void FillArray(int[,] matr)      //Заполняем двумерный массив случайными числами
{
    for(int i = 0; i < matr.GetLength(0); i++)
    {
        for(int j = 0; j < matr.GetLength(1); j++)
        {
            matr[i, j] = new Random().Next(1,10); // [1, 10) интервал от 1 до 10
        }
    }
}


int[,] matrix = new int[3, 4];

PrintArray(matrix);
FillArray(matrix);
Console.WriteLine();
PrintArray(matrix);
*/

/*
//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
//$$$ ЗАКРАСКА КАРТИНКИ С ПОМОЩЬЮ РЕКУРСИИ $$$
//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$ 

int[,] pic = new int[,]
{
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
 {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0 },
 {0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0 },
 {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
};

void PrintPict (int[,] image)
{
    for (int i = 0; i < image.GetLength(0); i++) //строки; GetLenhth(0) - 0 - это колисество строк: 3 строки
    {
        for(int j = 0; j < image.GetLength(1); j++)
        {
            //Console.Write($"{matr[i, j]} "); //индекс строки и индекс столбца
            if(image[i,j] == 0) Console.Write($" "); //если текущий элемент равен 0, то печатаем пробел
            else Console.Write($"+");
        }
        Console.WriteLine();    
    }
}

void FillImage(int row, int col) //метод закраски картинки. Аргумент - позиция строки и пикселя с котороцй нужно начать
{
    if(pic[row, col] == 0)
    {
        pic[row, col] = 1; //если текущий элемент равео 0, то красим его в 1
        FillImage(row - 1, col); //метод выызвает сам себя. поднимаемся вверх по массиву. row-1 - строк вверх, col - остается неизменным.
        FillImage(row, col - 1); // идем влево
        FillImage(row + 1, col); // идем вниз   // ЭТО РЕКУРСИЯ - метод вызывает сам себя
        FillImage(row, col + 1); // идем вправо
    }

}

PrintPict(pic);
FillImage(13, 13); //точка 13,13 указана как начальная
PrintPict(pic);
*/



//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
//$$$ НАХОЖДЕНИЕ ФАКТОРИАЛА С ПОМОЩЬЮ РЕКУРСИИ (5! = 5*4*3*2*1);  5! = 5*4!; 4! = 4*3!......$$$
//$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$


/*
double Factorial(int n)
{
    if(n == 1) return 1; //1!=1; 0!=1
    else return n*Factorial(n - 1);
}

for(int i = 1; i < 40; i++)
{
    Console.WriteLine($" {i} = {Factorial(i)}");
}
*/




//$$$$$$$$$$$$$$$$$$$$$$
//$$$ ЧИСЛА ФИБАНАЧИ $$$
//$$$$$$$$$$$$$$$$$$$$$$

// f(1) = 1
// f(2) = 1
// f(n) = f(n-1) + f(n-2)

/*
double Fibonacci (int n)
{
    if (n == 1 || n == 2) return 1; //если n=1 ИЛИ  n=2
    else return Fibonacci(n-1) + Fibonacci(n-2);
}

for (int i = 1; i < 40; i++)
{
    Console.WriteLine($"f({i}) = {Fibonacci(i)}");
}
*/



//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
//@@@ ДЕЛАЕМ ОБХОД ВСЕЙ ПАПКИ @@@
//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@



